notes/meeting_2021sep12.md
- [meeting notes September 12, 2021](#orgda9e66d)
  - [the usual links:](#org820585b)
    - [meeting notes](#org1362fc8)
    - [code examples:](#org9079f28)
  - [miscellanious miscellany](#org2a8529a)
    - [bruce gray's promised anti-Haskell spiel](#orgbfad539)
    - [A lot of stackoverflow traffic recently](#orge273bbe)
    - [bruce gray rosettacode posts:](#orgc815448)
    - [<https://modules.raku.org/dist/Game::Sudoku:cpan:SCIMON>](#org6b0500c)
    - [next meeting: Sept 26, 2021](#org0331499)
    - [tentative announcment: comparison case statement vs. multi-dispatch](#orgc742832)


<a id="orgda9e66d"></a>

# meeting notes September 12, 2021


<a id="org820585b"></a>

## the usual links:


<a id="org1362fc8"></a>

### meeting notes

1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2021sep12.md>


<a id="org9079f28"></a>

### code examples:

1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021sep12>


<a id="org2a8529a"></a>

## miscellanious miscellany


<a id="orgbfad539"></a>

### bruce gray's promised anti-Haskell spiel


<a id="orge273bbe"></a>

### A lot of stackoverflow traffic recently

1.  <https://stackoverflow.com/questions/68987098/raku-array-will-not-sort>

    1.  really a quoting issue, getting a list of quoted words doesn't work with "Q()"
    
    2.  <https://github.com/doomvox/raku-study/tree/main/bin/2021sep12/quoting_lists_of_words.pl6>


<a id="orgc815448"></a>

### bruce gray rosettacode posts:

1.  <http://rosettacode.org/wiki/Pandigital_prime#Raku>

2.  <http://rosettacode.org/wiki/Distinct_power_numbers#Raku>

3.  <http://rosettacode.org/wiki/Sum_of_primes_in_odd_positions_is_prime#Raku>


<a id="org6b0500c"></a>

### <https://modules.raku.org/dist/Game::Sudoku:cpan:SCIMON>


<a id="org0331499"></a>

### next meeting: Sept 26, 2021


<a id="orgc742832"></a>

### tentative announcment: comparison case statement vs. multi-dispatch
